inst/doc-Wilcoxon/wilcoxonTest.org
#+TITLE: Wilcoxon test via GPC
#+Author: Brice Ozenne

