inst/doc-Wilcoxon/wilcoxonTest.org
* Single Wilcoxon test

Generalized Pairwise comparisons include the Wilcoxon rank sum test as
a specific case. \newline Consider the following dataset (from the example
section of =stats::wilcox.test=):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
x <- c(1.83,  0.50,  1.62,  2.48, 1.68, 1.88, 1.55, 3.06, 1.30)
y <- c(0.878, 0.647, 0.598, 2.05, 1.06, 1.29, 1.06, 3.14, 1.29)
df <- rbind(data.frame(value = x, group="x"),
            data.frame(value = y, group="y"))
#+END_SRC

#+RESULTS:

We can perform a Wilcoxon test using the =wilcox.test= function:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
wilcox.test(value ~ group, data = df)
#+END_SRC

#+RESULTS:
#+begin_example

	Wilcoxon rank sum test with continuity correction

data:  value by group
W = 58, p-value = 0.1329
alternative hypothesis: true location shift is not equal to 0

Warning message:
In wilcox.test.default(x = c(1.83, 0.5, 1.62, 2.48, 1.68, 1.88,  :
  cannot compute exact p-value with ties
#+end_example

It unfortunately does not ouput any effect size (just the test
statistic and corresponding p-value). The package /asht/ contains an
alternative implementation:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(asht)
wmwTest(value ~ group, data = df, method = "asymptotic")
#+END_SRC

#+RESULTS:
#+begin_example

	Wilcoxon-Mann-Whitney test with continuity correction (confidence
	interval requires proportional odds assumption, but test does not)

data:  value by group
Mann-Whitney estimate = 0.28395, tie factor = 0.99794, p-value = 0.1329
alternative hypothesis: two distributions are not equal
95 percent confidence interval:
 0.1142978 0.5614097
sample estimates:
Mann-Whitney estimate 
            0.2839506
#+end_example

which does output an estimate[fn::Mann-Whitney parameter,
i.e. probability that a randomly chosen observation from one group has
higher value than a randomly chosen observation from the other
group]. It matches exactly the p.value and is based on an asymptotic
result. It is also possible to get an exact p-value [fn::this is only
feasible in small samples - otherwise the procedure becomes
computationnally challenging]:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
wmwTest(value ~ group, data = df, method = "exact.ce")
#+END_SRC

#+RESULTS:
#+begin_example

	exact Wilcoxon-Man-Whitney test (confidence interval requires
	proportional odds assumption, but test does not)

data:  value by group
Mann-Whitney estimate = 0.28395, p-value = 0.1299
alternative hypothesis: two distributions are not equal
95 percent confidence interval:
 0.09721823 0.56323417
sample estimates:
Mann-Whitney estimate 
            0.2839506
#+end_example

To match those results with GPC we can use a permutation test
(\Warning remember to add the argument =add.halfNeutral= to =TRUE= to
handle ties the same way as the previous tests):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eperm.BT <- BuyseTest(group ~ cont(value), data = df, add.halfNeutral = TRUE,
                      method.inference = "permutation", n.resampling = 10000,
                      trace = FALSE, seed = 10)
confint(eperm.BT, statistic = "favorable")
#+END_SRC

#+RESULTS:
:              estimate       se  lower.ci  upper.ci null p.value
: value_1e-12 0.2839506 0.140185 0.1050267 0.5725376  0.5  0.1242
: Warning message:
: In .local(object, ...) :
:   Confidence intervals are computed under the null hypothesis and therefore may not be valid.

The estimate is precisely the same and the p-value approximately the
same. Instead of permutation, we could use the asymptotic theory to
obtain p-values and (valid) confidence intervals:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest.options(order.Hprojection=2)
eU.BT <- BuyseTest(group ~ cont(value), data = df,
                  method.inference = "u-statistic",
                  add.halfNeutral = TRUE, trace = FALSE)
confint(eU.BT, statistic = "favorable")
#+END_SRC

#+RESULTS:
:              estimate        se   lower.ci  upper.ci null   p.value
: value_1e-12 0.2839506 0.1401461 0.09313769 0.6049215  0.5 0.1796262

Unsuprisingly, we get the same estimate. However the p-value seems
quite a bit different. This might be explained by the fact that this
approach does not assume iid[fn::iid=independent and identically
distributed] observations but only iid observations within each
group. A studentised permutation, which is exactly (instead of
asymptotically) valid under the same assumption, gives a somewhat
similar p-value:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
etperm.BT <- BuyseTest(group ~ cont(value), data = df, add.halfNeutral = TRUE,
                      method.inference = "studentized permutation", n.resampling = 10000,
                      trace = FALSE, seed = 10)
confint(etperm.BT, statistic = "favorable")
#+END_SRC

#+RESULTS:
:              estimate        se  lower.ci  upper.ci null p.value
: value_1e-12 0.2839506 0.1401461 0.1006681 0.5809142  0.5   0.163
: Warning message:
: In .local(object, ...) :
:   Confidence intervals are computed under the null hypothesis and therefore may not be valid.

