inst/doc-Wilcoxon/wilcoxonTest.tex

\section{Multiple Wilcoxon tests}
\label{sec:orgc55ca47}

Consider now the case where we would like to compare one reference
group (here strata \texttt{a}) to multiple treatment groups (here strata
\texttt{b,c,d,e}). We can apply the GPC procedure to each pair of group:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
set.seed(35)
dt <- simBuyseTest(n.T=25, n.strata = 5)
dt$id <- paste0("id",1:NROW(dt))
dt$strata <- as.character(dt$strata) 
ls.BT <- list("b-a=0" = BuyseTest(strata ~ cont(score), data = dt[dt$strata %in% c("a","b"),], add.halfNeutral = TRUE, trace = FALSE),
	      "c-a=0" = BuyseTest(strata ~ cont(score), data = dt[dt$strata %in% c("a","c"),], add.halfNeutral = TRUE, trace = FALSE),
	      "d-a=0" = BuyseTest(strata ~ cont(score), data = dt[dt$strata %in% c("a","d"),], add.halfNeutral = TRUE, trace = FALSE),
	      "e-a=0" = BuyseTest(strata ~ cont(score), data = dt[dt$strata %in% c("a","e"),], add.halfNeutral = TRUE, trace = FALSE))
M.confint <- do.call(rbind,lapply(ls.BT,confint, statistic = "favorable"))
cbind(M.confint,adj.p.value = p.adjust(M.confint[,"p.value"], method = "holm"))
\end{lstlisting}

\begin{verbatim}
       estimate        se  lower.ci  upper.ci null   p.value adj.p.value
b-a=0 0.4090909 0.1558762 0.1636179 0.7101478  0.5 0.5684920   1.0000000
c-a=0 0.4375000 0.1504794 0.1900359 0.7205413  0.5 0.6810731   1.0000000
d-a=0 0.2500000 0.1039600 0.1010765 0.4970240  0.5 0.0475426   0.1901704
e-a=0 0.3333333 0.1395624 0.1274089 0.6312937  0.5 0.2697305   0.8091916
\end{verbatim}



Because we compare the treatment groups to the same reference, the
test statistics are correlated and a Bonferroni adjustment would not
be optimal. Instead we can perform a max-test adjustment using the
\texttt{BuyseMultComp} function:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
e.mc <- BuyseMultComp(ls.BT, statistic = "favorable", cluster = "id")
e.mc[,c("estimate","se","p.value","adj.p.value")]
\end{lstlisting}

\begin{verbatim}
       estimate        se    p.value adj.p.value
b-a=0 0.4090909 0.1558762 0.58233805   0.9341655
c-a=0 0.4375000 0.1504794 0.68874960   0.9776452
d-a=0 0.2500000 0.1039600 0.06798526   0.1754300
e-a=0 0.3333333 0.1395624 0.29901488   0.6323694
\end{verbatim}


Here the smallest p-value has been multiplied by a factor 2.64 instead
of 4. This is thanks to the rather strong correlation between the test
statistics:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
M.cor <- cov2cor(crossprod(attr(e.mc,"iid")))
dimnames(M.cor) <- list(names(ls.BT),names(ls.BT))
M.cor
\end{lstlisting}

\begin{verbatim}
          b-a=0     c-a=0     d-a=0     e-a=0
b-a=0 1.0000000 0.6519486 0.5601058 0.7520401
c-a=0 0.6519486 1.0000000 0.4240003 0.5439927
d-a=0 0.5601058 0.4240003 1.0000000 0.5051815
e-a=0 0.7520401 0.5439927 0.5051815 1.0000000
\end{verbatim}
\end{document}